{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "pip install neo4j python-dotenv pandas pyvis"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Connection established.\n"
     ]
    }
   ],
   "source": [
    "from neo4j import GraphDatabase\n",
    "\n",
    "# URI examples: \"neo4j://localhost\", \"neo4j+s://xxx.databases.neo4j.io\"\n",
    "URI = \"bolt://localhost:7687\"\n",
    "AUTH = (\"neo4j\", \"password\")\n",
    "\n",
    "with GraphDatabase.driver(URI, auth=AUTH) as driver:\n",
    "    with driver.session(database=\"neo4j\") as session: # explicit db allows the driver to work more efficiently\n",
    "        driver.verify_connectivity()\n",
    "        print(\"Connection established.\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Get the name of all 42 year-olds\n",
    "records, summary, keys = driver.execute_query(\n",
    "    \"MATCH (p:PLAYER) WHERE p.name = 'LeBron James' RETURN p\",\n",
    "    # auth_=(\"neo4j\", \"password\"),  run query as someone else instead of creating a new driver\n",
    "    database_=\"neo4j\", # speciry the database to connect to here\n",
    ")\n",
    "\n",
    "# run query as a different user\n",
    "driver.execute_query(\n",
    "    \"MATCH (p:Person) RETURN p.name\",\n",
    "    impersonated_user_=\"somebody_else\",\n",
    "    database_=\"neo4j\",\n",
    ")\n",
    "\n",
    "driver.execute_query(\n",
    "    \"MATCH (p:Person) RETURN p.name\",\n",
    "    auth_=(\"somebody_else\", \"their_password\"),\n",
    "    database_=\"neo4j\",\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 154,
   "metadata": {},
   "outputs": [],
   "source": [
    "class Player:\n",
    "    def __init__(self, name, age):\n",
    "        self.name = name\n",
    "        self.age = age"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 176,
   "metadata": {},
   "outputs": [],
   "source": [
    "def formatter(records, summary=None, keys=None):\n",
    "    # Loop through results and do something with them\n",
    "    for record in records:\n",
    "        print(record.data())  # obtain record as dict\n",
    "\n",
    "    if summary and keys:\n",
    "        # Summary information\n",
    "        print(\"The query `{query}` returned {records_count} records in {time} ms.\".format(\n",
    "            query=summary.query, records_count=len(records),\n",
    "            time=summary.result_available_after\n",
    "        ))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 157,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'player': {'name': 'Ezra', 'age': 23}}\n",
      "The query `CREATE (player:PLAYER {name: $name, age: $age}) RETURN player` returned 1 records in 1 ms.\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/var/folders/pq/j682cyjd7cb0xq6g_rj_397w0000gn/T/ipykernel_29955/2350641073.py:3: DeprecationWarning: Using a driver after it has been closed is deprecated. Future versions of the driver will raise an error.\n",
      "  records, summary, keys = driver.execute_query(\n"
     ]
    }
   ],
   "source": [
    "def create(player: Player):\n",
    "    try:\n",
    "        records, summary, keys = driver.execute_query(\n",
    "            \"\"\"CREATE (player:PLAYER {name: $name, age: $age}) RETURN player\"\"\",\n",
    "            name= player.name,\n",
    "            age= player.age\n",
    "            )\n",
    "        return records, summary, keys\n",
    "    except Exception as e:\n",
    "        print(e)\n",
    "        raise e\n",
    "\n",
    "records, summary, keys = create(Player(name= \"Ezra\", age= 23))\n",
    "formatter(records, summary, keys)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 188,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'player': {'name': 'Ezra', 'age': 23}}\n",
      "The query `MERGE (player:PLAYER {name: $name, age: $age}) RETURN player` returned 1 records in 1 ms.\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/var/folders/pq/j682cyjd7cb0xq6g_rj_397w0000gn/T/ipykernel_29955/1823666447.py:4: DeprecationWarning: Using a driver after it has been closed is deprecated. Future versions of the driver will raise an error.\n",
      "  records, summary, keys = driver.execute_query(\n"
     ]
    }
   ],
   "source": [
    "# create if player with given properties does not exist\n",
    "def create_if_no_exist(player: Player):\n",
    "    try:\n",
    "        records, summary, keys = driver.execute_query(\n",
    "            \"\"\"MERGE (player:PLAYER {name: $name, age: $age}) RETURN player\"\"\",\n",
    "            name= player.name,\n",
    "            age= player.age\n",
    "            )\n",
    "        return records, summary, keys\n",
    "    except Exception as e:\n",
    "        print(e)\n",
    "        raise e\n",
    "\n",
    "records, summary, keys = create_if_no_exist(Player(name= \"Ezra\", age= 23)) \n",
    "formatter(records, summary, keys)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 189,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'p': {'name': 'Carolynn', 'age': 23}}\n",
      "{'p': {'name': 'Ezra', 'age': '25'}}\n",
      "{'p': {'name': 'Ezra', 'age': 23}}\n",
      "The query `\n",
      "            MATCH (p:PLAYER) RETURN p` returned 3 records in 2 ms.\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/var/folders/pq/j682cyjd7cb0xq6g_rj_397w0000gn/T/ipykernel_29955/2625414688.py:3: DeprecationWarning: Using a driver after it has been closed is deprecated. Future versions of the driver will raise an error.\n",
      "  records, summary, keys = driver.execute_query(\"\"\"\n"
     ]
    }
   ],
   "source": [
    "def read():\n",
    "    try:\n",
    "        records, summary, keys = driver.execute_query(\"\"\"\n",
    "            MATCH (p:PLAYER) RETURN p\"\"\")\n",
    "        return records, summary, keys\n",
    "    except Exception as e:\n",
    "        print(e)\n",
    "        raise e\n",
    "\n",
    "records, summary, keys = read()\n",
    "formatter(records, summary, keys)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 159,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'player': {'name': 'Ezra', 'age': '25'}}\n",
      "The query `\n",
      "            MATCH (player: PLAYER)\n",
      "            WHERE player.name = \"Ezra\"\n",
      "            SET player.name = $name, player.age=$age\n",
      "            RETURN player\n",
      "            ` returned 1 records in 18 ms.\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/var/folders/pq/j682cyjd7cb0xq6g_rj_397w0000gn/T/ipykernel_29955/2235784898.py:3: DeprecationWarning: Using a driver after it has been closed is deprecated. Future versions of the driver will raise an error.\n",
      "  records, summary, keys = driver.execute_query(f\"\"\"\n"
     ]
    }
   ],
   "source": [
    "def update(name, player:Player):\n",
    "    try:\n",
    "        records, summary, keys = driver.execute_query(f\"\"\"\n",
    "            MATCH (player: PLAYER)\n",
    "            WHERE player.name = \"{name}\"\n",
    "            SET player.name = $name, player.age=$age\n",
    "            RETURN player\n",
    "            \"\"\",\n",
    "            parameters_ = player.__dict__\n",
    "            )\n",
    "        return records, summary, keys\n",
    "    except Exception as e:\n",
    "        print(e)\n",
    "        raise e\n",
    "\n",
    "records, summary, keys = update(\"Ezra\",Player(name=\"Ezra\", age=\"25\"))\n",
    "formatter(records, summary, keys)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 160,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/var/folders/pq/j682cyjd7cb0xq6g_rj_397w0000gn/T/ipykernel_29955/3319249233.py:2: DeprecationWarning: Using a driver after it has been closed is deprecated. Future versions of the driver will raise an error.\n",
      "  driver.execute_query(\"\"\"\n"
     ]
    }
   ],
   "source": [
    "def add_relationship():\n",
    "    driver.execute_query(\"\"\"\n",
    "        MATCH (ezra: PLAYER {name: \"Ezra\"})\n",
    "        MATCH (carol: PLAYER {name: \"Carolynn\"})\n",
    "        CREATE (ezra)-[:TEAMMATES]->(carol)\n",
    "    \"\"\")\n",
    "add_relationship()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 150,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/var/folders/pq/j682cyjd7cb0xq6g_rj_397w0000gn/T/ipykernel_29955/3405002177.py:1: DeprecationWarning: Using a driver after it has been closed is deprecated. Future versions of the driver will raise an error.\n",
      "  driver.execute_query(\"MATCH (n) DETACH DELETE n\")\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "EagerResult(records=[], summary=<neo4j._work.summary.ResultSummary object at 0x10f069e10>, keys=[])"
      ]
     },
     "execution_count": 150,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "driver.execute_query(\"MATCH (n) DETACH DELETE n\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 161,
   "metadata": {},
   "outputs": [],
   "source": [
    "import neo4j"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 162,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/var/folders/pq/j682cyjd7cb0xq6g_rj_397w0000gn/T/ipykernel_29955/2949146807.py:2: DeprecationWarning: Using a driver after it has been closed is deprecated. Future versions of the driver will raise an error.\n",
      "  pandas_df = driver.execute_query(\"\"\"\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>p</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>(name, age)</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>(name, age)</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "             p\n",
       "0  (name, age)\n",
       "1  (name, age)"
      ]
     },
     "execution_count": 162,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# transform to pandas dataframe\n",
    "pandas_df = driver.execute_query(\"\"\"\n",
    "                MATCH (p:PLAYER) RETURN p\"\"\", \n",
    "                result_transformer_=neo4j.Result.to_df\n",
    "            )\n",
    "pandas_df.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 163,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/var/folders/pq/j682cyjd7cb0xq6g_rj_397w0000gn/T/ipykernel_29955/738753035.py:2: DeprecationWarning: Using a driver after it has been closed is deprecated. Future versions of the driver will raise an error.\n",
      "  graph_result = driver.execute_query(\"\"\"\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "<neo4j.graph.Graph at 0x10f08a320>"
      ]
     },
     "execution_count": 163,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# transform to graph\n",
    "graph_result = driver.execute_query(\"\"\"\n",
    "                MATCH (p:PLAYER) RETURN p\"\"\", \n",
    "                result_transformer_=neo4j.Result.graph\n",
    "            )\n",
    "graph_result"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 164,
   "metadata": {},
   "outputs": [],
   "source": [
    "import pyvis\n",
    "\n",
    "def visualize_result(query_graph, nodes_text_properties):\n",
    "    visual_graph = pyvis.network.Network()\n",
    "\n",
    "    for node in query_graph.nodes:\n",
    "        node_label = list(node.labels)[0]\n",
    "        node_text = node[nodes_text_properties[node_label]]\n",
    "        visual_graph.add_node(node.element_id, node_text, group=node_label)\n",
    "\n",
    "    for relationship in query_graph.relationships:\n",
    "        visual_graph.add_edge(\n",
    "            relationship.start_node.element_id,\n",
    "            relationship.end_node.element_id,\n",
    "            title=relationship.type\n",
    "        )\n",
    "\n",
    "    visual_graph.show('network.html', notebook=False)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 165,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "network.html\n"
     ]
    }
   ],
   "source": [
    "nodes_text_properties = {  # what property to use as text for each node\n",
    "            \"PLAYER\": \"name\",\n",
    "        }\n",
    "visualize_result(graph_result, nodes_text_properties)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Running a managed transaction"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 183,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'name': 'Carolynn', 'age': 23}\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/var/folders/pq/j682cyjd7cb0xq6g_rj_397w0000gn/T/ipykernel_29955/2757852450.py:14: DeprecationWarning: Using a driver after it has been closed is deprecated. Future versions of the driver will raise an error.\n",
      "  with driver.session(database=\"neo4j\") as session:\n"
     ]
    }
   ],
   "source": [
    "# transaction callback function\n",
    "def match_player(tx, filter):\n",
    "    result = tx.run(\n",
    "        \"\"\"\n",
    "            MATCH (p:PLAYER)\n",
    "            WHERE p.name  STARTS WITH $filter\n",
    "            RETURN p.name AS name, p.age AS age\n",
    "            ORDER BY p.name\n",
    "        \"\"\", \n",
    "        filter=filter\n",
    "    )\n",
    "    return list (result) # always cast the Result obj into a list\n",
    "\n",
    "# sessions are lightweight so can be created multiple times compared to drivers\n",
    "with driver.session(database=\"neo4j\") as session:\n",
    "    players = session.execute_read(match_player, \"Car\")\n",
    "    session.close()\n",
    "formatter(players)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 193,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/var/folders/pq/j682cyjd7cb0xq6g_rj_397w0000gn/T/ipykernel_29955/3265026717.py:12: DeprecationWarning: Using a driver after it has been closed is deprecated. Future versions of the driver will raise an error.\n",
      "  with driver.session(database=\"neo4j\") as session:\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "3"
      ]
     },
     "execution_count": 193,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# configure a transaction behaviour using decorators\n",
    "from neo4j import unit_of_work\n",
    "@unit_of_work(timeout=5, metadata={\"app_name\": \"Player tracker\"})\n",
    "def count_player(tx):\n",
    "    result = tx.run(\"\"\"\n",
    "            MATCH (player:PLAYER)\n",
    "            RETURN COUNT(player) as no_players\n",
    "        \"\"\")\n",
    "    record = result.single()\n",
    "    return record[\"no_players\"]\n",
    "\n",
    "with driver.session(database=\"neo4j\") as session:\n",
    "    player_n  = session.execute_read(count_player)\n",
    "player_n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 213,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[{'n': {'name': 'Carolynn', 'age': 23}}, {'n': {'name': 'Ezra', 'age': '25'}}, {'n': {'name': 'Ezra', 'age': 23}}, {'n': {'name': 'Tarus', 'age': 25, 'status': 'single asf'}}]\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/var/folders/pq/j682cyjd7cb0xq6g_rj_397w0000gn/T/ipykernel_29955/4275692550.py:1: DeprecationWarning: Using a driver after it has been closed is deprecated. Future versions of the driver will raise an error.\n",
      "  with driver.session(database=\"neo4j\") as session:\n"
     ]
    }
   ],
   "source": [
    "with driver.session(\n",
    "    database=\"neo4j\", \n",
    "    # auth=() # switching user at sesion level is cheap than creating new Diver object\n",
    "    # impersonated_user=\"somebody\" # will be useful if need to alter something so you are given permission\n",
    "    ) as session:\n",
    "    with session.begin_transaction() as tx: # create a transaction and run multimple queries within it \n",
    "        tx.run(\"MERGE (player: PLAYER {name: 'Tarus', age:25, status: 'single asf'})\")\n",
    "        result = tx.run(\"MATCH (n) RETURN n\")  \n",
    "        print(result.data())\n",
    "        # tx.commit()     "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### An end to end transaction very good"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "import neo4j\n",
    "\n",
    "\n",
    "URI = \"<URI for Neo4j database>\"\n",
    "AUTH = (\"<Username>\", \"<Password>\")\n",
    "\n",
    "\n",
    "def main():\n",
    "    with neo4j.GraphDatabase.driver(URI, auth=AUTH) as driver:\n",
    "        customer_id = create_customer(driver)\n",
    "        other_bank_id = 42\n",
    "        transfer_to_other_bank(driver, customer_id, other_bank_id, 999)\n",
    "\n",
    "\n",
    "def create_customer(driver):\n",
    "    result, _, _ = driver.execute_query(\"\"\"\n",
    "        MERGE (c:Customer {id: rand()})\n",
    "        RETURN c.id AS id\n",
    "    \"\"\", database_ = \"neo4j\")\n",
    "    return result[0][\"id\"]\n",
    "\n",
    "\n",
    "def transfer_to_other_bank(driver, customer_id, other_bank_id, amount):\n",
    "    with driver.session(database=\"neo4j\") as session:\n",
    "        with session.begin_transaction() as tx:\n",
    "            if not customer_balance_check(tx, customer_id, amount):\n",
    "                # give up\n",
    "                return\n",
    "\n",
    "            other_bank_transfer_api(customer_id, other_bank_id, amount)\n",
    "            # Now the money has been transferred => can't rollback anymore\n",
    "            # (cannot rollback external services interactions)\n",
    "\n",
    "            try:\n",
    "                decrease_customer_balance(tx, customer_id, amount)\n",
    "                tx.commit()\n",
    "            except Exception as e:\n",
    "                request_inspection(customer_id, other_bank_id, amount, e)\n",
    "                raise  # roll back\n",
    "\n",
    "\n",
    "def customer_balance_check(tx, customer_id, amount):\n",
    "    query = (\"\"\"\n",
    "        MATCH (c:Customer {id: $id})\n",
    "        RETURN c.balance >= $amount AS sufficient\n",
    "    \"\"\")\n",
    "    result = tx.run(query, id=customer_id, amount=amount)\n",
    "    record = result.single(strict=True)\n",
    "    return record[\"sufficient\"]\n",
    "\n",
    "\n",
    "def other_bank_transfer_api(customer_id, other_bank_id, amount):\n",
    "    # make some API call to other bank\n",
    "    pass\n",
    "\n",
    "\n",
    "def decrease_customer_balance(tx, customer_id, amount):\n",
    "    query = (\"\"\"\n",
    "        MATCH (c:Customer {id: $id})\n",
    "        SET c.balance = c.balance - $amount\n",
    "    \"\"\")\n",
    "    result = tx.run(query, id=customer_id, amount=amount)\n",
    "    result.consume()\n",
    "\n",
    "\n",
    "def request_inspection(customer_id, other_bank_id, amount, e):\n",
    "    # manual cleanup required; log this or similar\n",
    "    print(\"WARNING: transaction rolled back due to exception:\", repr(e))\n",
    "    print(\"customer_id:\", customer_id, \"other_bank_id:\", other_bank_id,\n",
    "          \"amount:\", amount)\n",
    "\n",
    "\n",
    "if __name__ == \"__main__\":\n",
    "    main()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase, Bookmarks\n",
    "\n",
    "\n",
    "URI = \"<URI for Neo4j database>\"\n",
    "AUTH = (\"<Username>\", \"<Password>\")\n",
    "\n",
    "def main():\n",
    "    with GraphDatabase.driver(URI, auth=AUTH) as driver:\n",
    "        driver.verify_connectivity()\n",
    "        create_some_friends(driver)\n",
    "\n",
    "\n",
    "def create_some_friends(driver):\n",
    "    saved_bookmarks = Bookmarks()  # To collect the sessions' bookmarks\n",
    "\n",
    "    # Create the first person and employment relationship\n",
    "    with driver.session(database=\"neo4j\") as session_a:\n",
    "        session_a.execute_write(create_person, \"Alice\")\n",
    "        session_a.execute_write(employ, \"Alice\", \"Wayne Enterprises\")\n",
    "        saved_bookmarks += session_a.last_bookmarks()\n",
    "\n",
    "    # Create the second person and employment relationship\n",
    "    with driver.session(database=\"neo4j\") as session_b:\n",
    "        session_b.execute_write(create_person, \"Bob\")\n",
    "        session_b.execute_write(employ, \"Bob\", \"LexCorp\")\n",
    "        saved_bookmarks += session_b.last_bookmarks()\n",
    "\n",
    "    # Create a friendship between the two people created above\n",
    "    with driver.session(\n",
    "        database=\"neo4j\", bookmarks=saved_bookmarks\n",
    "    ) as session_c:\n",
    "        session_c.execute_write(create_friendship, \"Alice\", \"Bob\")\n",
    "        session_c.execute_read(print_friendships)\n",
    "\n",
    "\n",
    "# Create a person node\n",
    "def create_person(tx, name):\n",
    "    tx.run(\"MERGE (:Person {name: $name})\", name=name)\n",
    "\n",
    "\n",
    "# Create an employment relationship to a pre-existing company node\n",
    "# This relies on the person first having been created.\n",
    "def employ(tx, person_name, company_name):\n",
    "    tx.run(\"\"\"\n",
    "        MATCH (person:Person {name: $person_name})\n",
    "        MATCH (company:Company {name: $company_name})\n",
    "        CREATE (person)-[:WORKS_FOR]->(company)\n",
    "        \"\"\", person_name=person_name, company_name=company_name\n",
    "    )\n",
    "\n",
    "\n",
    "# Create a friendship between two people\n",
    "def create_friendship(tx, name_a, name_b):\n",
    "    tx.run(\"\"\"\n",
    "        MATCH (a:Person {name: $name_a})\n",
    "        MATCH (b:Person {name: $name_b})\n",
    "        MERGE (a)-[:KNOWS]->(b)\n",
    "        \"\"\", name_a=name_a, name_b=name_b\n",
    "    )\n",
    "\n",
    "\n",
    "# Retrieve and display all friendships\n",
    "def print_friendships(tx):\n",
    "    result = tx.run(\"MATCH (a)-[:KNOWS]->(b) RETURN a.name, b.name\")\n",
    "    for record in result:\n",
    "        print(\"{} knows {}\".format(record[\"a.name\"], record[\"b.name\"]))\n",
    "\n",
    "\n",
    "if __name__ == \"__main__\":\n",
    "    main()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### asynchronouse execution"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "import asyncio\n",
    "from neo4j import AsyncGraphDatabase\n",
    "\n",
    "\n",
    "URI = \"<URI for Neo4j database>\"\n",
    "AUTH = (\"<Username>\", \"<Password>\")\n",
    "\n",
    "\n",
    "async def main():\n",
    "    async with AsyncGraphDatabase.driver(URI, auth=AUTH) as driver:\n",
    "        records, summary, keys = await driver.execute_query(\n",
    "            \"MATCH (a:Person) RETURN a.name AS name\",\n",
    "            database_=\"neo4j\"\n",
    "        )\n",
    "        names = [record[\"name\"] for record in records]\n",
    "        print(names)\n",
    "\n",
    "\n",
    "if __name__ == \"__main__\":\n",
    "    asyncio.run(main())"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Implicit runs session.run() useful in executions that might timeout"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 214,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/var/folders/pq/j682cyjd7cb0xq6g_rj_397w0000gn/T/ipykernel_29955/2363721342.py:1: DeprecationWarning: Using a driver after it has been closed is deprecated. Future versions of the driver will raise an error.\n",
      "  with driver.session(database=\"neo4j\") as session:\n",
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.FeatureDeprecationWarning} {category: DEPRECATION} {title: This feature is deprecated and will be removed in future versions.} {description: CALL subquery without a variable scope clause is now deprecated. Use CALL (line) { ... }} {position: line: 3, column: 9, offset: 82} for query: \"\\n        LOAD CSV FROM 'https://data.neo4j.com/bands/artists.csv' AS line\\n        CALL {\\n            WITH line\\n            MERGE (:Artist {name: line[1], age: toInteger(line[2])})\\n        } IN TRANSACTIONS OF 2 ROWS\\n    \"\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'_contains_updates': True, 'labels_added': 4, 'nodes_created': 4, 'properties_set': 8}\n"
     ]
    }
   ],
   "source": [
    "with driver.session(database=\"neo4j\") as session:\n",
    "    result = session.run(\"\"\"\n",
    "        LOAD CSV FROM 'https://data.neo4j.com/bands/artists.csv' AS line\n",
    "        CALL {\n",
    "            WITH line\n",
    "            MERGE (:Artist {name: line[1], age: toInteger(line[2])})\n",
    "        } IN TRANSACTIONS OF 2 ROWS\n",
    "    \"\"\")\n",
    "    print(result.consume().counters)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "`property keys, so MATCH (n) WHERE n.$param = 'something' is invalid;`\n",
    "\n",
    "`relationship types, so MATCH (n)-[:$param]→(m) is invalid;`\n",
    "\n",
    "`labels, so MATCH (n:$param) is invalid.`"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# escape labels when you have to cocnatenate in the query to prevent cypher injection\n",
    "label = \"Person\\\\u0060n\"\n",
    "# convert \\u0060 to literal backtick and then escape backticks\n",
    "escaped_label = label.replace(\"\\\\u0060\", \"`\").replace(\"`\", \"``\")\n",
    "\n",
    "driver.execute_query(\n",
    "    f\"MATCH (p:`{escaped_label}` {{name: $name}}) RETURN p.name\",\n",
    "    name=\"Alice\",\n",
    "    database_=\"neo4j\"\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "property_key = \"name\"\n",
    "label = \"Person\"\n",
    "\n",
    "driver.execute_query(\n",
    "    \"CALL apoc.merge.node($labels, $properties)\",\n",
    "    labels=[label], properties={property_key: \"Alice\"},\n",
    "    database_=\"neo4j\"\n",
    ")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Lazy loading and eager loading"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 216,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[1734946846.32] LAZY LOADING (execute_read)\n",
      "[1734946846.33] Submit query\n",
      "[1734946846.76] Processing record 0\n",
      "[1734946847.32] Processing record 1\n",
      "[1734946847.9] Processing record 2\n",
      "[1734946848.46] Processing record 3\n",
      "[1734946849.01] Processing record 4\n",
      "[1734946849.57] Processing record 5\n",
      "[1734946850.13] Processing record 6\n",
      "[1734946850.7] Processing record 7\n",
      "[1734946851.26] Processing record 8\n",
      "[1734946851.82] Processing record 9\n",
      "[1734946852.38] Processing record 10\n",
      "[1734946852.93] Processing record 11\n",
      "[1734946853.49] Processing record 12\n",
      "[1734946854.05] Processing record 13\n",
      "[1734946854.6] Processing record 14\n",
      "[1734946855.16] Processing record 15\n",
      "[1734946855.72] Processing record 16\n",
      "[1734946856.27] Processing record 17\n",
      "[1734946856.82] Processing record 18\n",
      "[1734946857.37] Processing record 19\n",
      "[1734946857.92] Processing record 20\n",
      "[1734946858.47] Processing record 21\n",
      "[1734946859.02] Processing record 22\n",
      "[1734946859.56] Processing record 23\n",
      "[1734946860.11] Processing record 24\n",
      "[1734946860.66] Processing record 25\n",
      "[1734946861.2] Processing record 26\n",
      "[1734946861.75] Processing record 27\n",
      "[1734946862.3] Processing record 28\n",
      "[1734946862.85] Processing record 29\n",
      "[1734946863.4] Processing record 30\n",
      "[1734946863.95] Processing record 31\n",
      "[1734946864.5] Processing record 32\n",
      "[1734946865.04] Processing record 33\n",
      "[1734946865.59] Processing record 34\n",
      "[1734946866.14] Processing record 35\n",
      "[1734946866.68] Processing record 36\n",
      "[1734946867.23] Processing record 37\n",
      "[1734946867.82] Processing record 38\n",
      "[1734946868.37] Processing record 39\n",
      "[1734946868.93] Processing record 40\n",
      "[1734946869.47] Processing record 41\n",
      "[1734946870.02] Processing record 42\n",
      "[1734946870.57] Processing record 43\n",
      "[1734946871.11] Processing record 44\n",
      "[1734946871.66] Processing record 45\n",
      "[1734946872.21] Processing record 46\n",
      "[1734946872.76] Processing record 47\n",
      "[1734946873.3] Processing record 48\n",
      "[1734946873.85] Processing record 49\n",
      "[1734946874.4] Processing record 50\n",
      "[1734946874.93] Processing record 51\n",
      "[1734946875.48] Processing record 52\n",
      "[1734946876.04] Processing record 53\n",
      "[1734946876.59] Processing record 54\n",
      "[1734946877.13] Processing record 55\n",
      "[1734946877.67] Processing record 56\n",
      "[1734946878.22] Processing record 57\n",
      "[1734946878.77] Processing record 58\n",
      "[1734946879.31] Processing record 59\n",
      "[1734946879.86] Processing record 60\n",
      "[1734946880.41] Processing record 61\n",
      "[1734946880.95] Processing record 62\n",
      "[1734946881.5] Processing record 63\n",
      "[1734946882.05] Processing record 64\n",
      "[1734946882.6] Processing record 65\n",
      "[1734946883.14] Processing record 66\n",
      "[1734946883.69] Processing record 67\n",
      "[1734946884.24] Processing record 68\n",
      "[1734946884.79] Processing record 69\n",
      "[1734946885.33] Processing record 70\n",
      "[1734946885.88] Processing record 71\n",
      "[1734946886.44] Processing record 72\n",
      "[1734946886.98] Processing record 73\n",
      "[1734946887.53] Processing record 74\n",
      "[1734946888.08] Processing record 75\n",
      "[1734946888.62] Processing record 76\n",
      "[1734946889.17] Processing record 77\n",
      "[1734946889.72] Processing record 78\n",
      "[1734946890.26] Processing record 79\n",
      "[1734946890.81] Processing record 80\n",
      "[1734946891.36] Processing record 81\n",
      "[1734946891.91] Processing record 82\n",
      "[1734946892.45] Processing record 83\n",
      "[1734946893.0] Processing record 84\n",
      "[1734946893.55] Processing record 85\n",
      "[1734946894.09] Processing record 86\n",
      "[1734946894.63] Processing record 87\n",
      "[1734946895.18] Processing record 88\n",
      "[1734946895.73] Processing record 89\n",
      "[1734946896.28] Processing record 90\n",
      "[1734946896.82] Processing record 91\n",
      "[1734946897.37] Processing record 92\n",
      "[1734946897.92] Processing record 93\n",
      "[1734946898.47] Processing record 94\n",
      "[1734946899.01] Processing record 95\n",
      "[1734946899.56] Processing record 96\n",
      "[1734946900.11] Processing record 97\n",
      "[1734946900.65] Processing record 98\n",
      "[1734946901.2] Processing record 99\n",
      "[1734946901.75] Processing record 100\n",
      "[1734946902.3] Processing record 101\n",
      "[1734946902.84] Processing record 102\n",
      "[1734946903.39] Processing record 103\n",
      "[1734946903.94] Processing record 104\n",
      "[1734946904.49] Processing record 105\n",
      "[1734946905.03] Processing record 106\n",
      "[1734946905.58] Processing record 107\n",
      "[1734946906.13] Processing record 108\n",
      "[1734946906.68] Processing record 109\n",
      "[1734946907.21] Processing record 110\n",
      "[1734946907.78] Processing record 111\n",
      "[1734946908.32] Processing record 112\n",
      "[1734946908.87] Processing record 113\n",
      "[1734946909.42] Processing record 114\n",
      "[1734946909.97] Processing record 115\n",
      "[1734946910.51] Processing record 116\n",
      "[1734946911.05] Processing record 117\n",
      "[1734946911.61] Processing record 118\n",
      "[1734946912.15] Processing record 119\n",
      "[1734946912.69] Processing record 120\n",
      "[1734946913.24] Processing record 121\n",
      "[1734946913.79] Processing record 122\n",
      "[1734946914.34] Processing record 123\n",
      "[1734946914.88] Processing record 124\n",
      "[1734946915.43] Processing record 125\n",
      "[1734946915.97] Processing record 126\n",
      "[1734946916.52] Processing record 127\n",
      "[1734946917.06] Processing record 128\n",
      "[1734946917.6] Processing record 129\n",
      "[1734946918.16] Processing record 130\n",
      "[1734946918.7] Processing record 131\n",
      "[1734946919.24] Processing record 132\n",
      "[1734946919.79] Processing record 133\n",
      "[1734946920.34] Processing record 134\n",
      "[1734946920.88] Processing record 135\n",
      "[1734946921.43] Processing record 136\n",
      "[1734946921.97] Processing record 137\n",
      "[1734946922.52] Processing record 138\n",
      "[1734946923.09] Processing record 139\n",
      "[1734946923.64] Processing record 140\n",
      "[1734946924.18] Processing record 141\n",
      "[1734946924.73] Processing record 142\n",
      "[1734946925.27] Processing record 143\n",
      "[1734946925.82] Processing record 144\n",
      "[1734946926.37] Processing record 145\n",
      "[1734946926.92] Processing record 146\n",
      "[1734946927.48] Processing record 147\n",
      "[1734946928.03] Processing record 148\n",
      "[1734946928.58] Processing record 149\n",
      "[1734946929.13] Processing record 150\n",
      "[1734946929.68] Processing record 151\n",
      "[1734946930.21] Processing record 152\n",
      "[1734946930.76] Processing record 153\n",
      "[1734946931.31] Processing record 154\n",
      "[1734946931.86] Processing record 155\n",
      "[1734946932.4] Processing record 156\n",
      "[1734946932.94] Processing record 157\n",
      "[1734946933.49] Processing record 158\n",
      "[1734946934.04] Processing record 159\n",
      "[1734946934.59] Processing record 160\n",
      "[1734946935.14] Processing record 161\n",
      "[1734946935.69] Processing record 162\n",
      "[1734946936.23] Processing record 163\n",
      "[1734946936.77] Processing record 164\n",
      "[1734946937.32] Processing record 165\n",
      "[1734946937.87] Processing record 166\n",
      "[1734946938.44] Processing record 167\n",
      "[1734946939.02] Processing record 168\n",
      "[1734946939.56] Processing record 169\n",
      "[1734946940.12] Processing record 170\n",
      "[1734946940.67] Processing record 171\n",
      "[1734946941.21] Processing record 172\n",
      "[1734946941.75] Processing record 173\n",
      "[1734946942.3] Processing record 174\n",
      "[1734946942.85] Processing record 175\n",
      "[1734946943.39] Processing record 176\n",
      "[1734946943.94] Processing record 177\n",
      "[1734946944.49] Processing record 178\n",
      "[1734946945.04] Processing record 179\n",
      "[1734946945.58] Processing record 180\n",
      "[1734946946.13] Processing record 181\n",
      "[1734946946.68] Processing record 182\n",
      "[1734946947.23] Processing record 183\n",
      "[1734946947.77] Processing record 184\n",
      "[1734946948.32] Processing record 185\n",
      "[1734946948.87] Processing record 186\n",
      "[1734946949.41] Processing record 187\n",
      "[1734946949.95] Processing record 188\n",
      "[1734946950.5] Processing record 189\n",
      "[1734946951.05] Processing record 190\n",
      "[1734946951.6] Processing record 191\n",
      "[1734946952.14] Processing record 192\n",
      "[1734946952.69] Processing record 193\n",
      "[1734946953.24] Processing record 194\n",
      "[1734946953.79] Processing record 195\n",
      "[1734946954.33] Processing record 196\n",
      "[1734946954.87] Processing record 197\n",
      "[1734946955.42] Processing record 198\n",
      "[1734946955.97] Processing record 199\n",
      "[1734946956.51] Processing record 200\n",
      "[1734946957.06] Processing record 201\n",
      "[1734946957.61] Processing record 202\n",
      "[1734946958.16] Processing record 203\n",
      "[1734946958.7] Processing record 204\n",
      "[1734946959.25] Processing record 205\n",
      "[1734946959.8] Processing record 206\n",
      "[1734946960.35] Processing record 207\n",
      "[1734946960.89] Processing record 208\n",
      "[1734946961.44] Processing record 209\n",
      "[1734946961.99] Processing record 210\n",
      "[1734946962.54] Processing record 211\n",
      "[1734946963.08] Processing record 212\n",
      "[1734946963.62] Processing record 213\n",
      "[1734946964.18] Processing record 214\n",
      "[1734946964.72] Processing record 215\n",
      "[1734946965.26] Processing record 216\n",
      "[1734946965.81] Processing record 217\n",
      "[1734946966.36] Processing record 218\n",
      "[1734946966.91] Processing record 219\n",
      "[1734946967.45] Processing record 220\n",
      "[1734946968.0] Processing record 221\n",
      "[1734946968.55] Processing record 222\n",
      "[1734946969.09] Processing record 223\n",
      "[1734946969.64] Processing record 224\n",
      "[1734946970.18] Processing record 225\n",
      "[1734946970.73] Processing record 226\n",
      "[1734946971.28] Processing record 227\n",
      "[1734946971.82] Processing record 228\n",
      "[1734946972.37] Processing record 229\n",
      "[1734946972.92] Processing record 230\n",
      "[1734946973.47] Processing record 231\n",
      "[1734946974.01] Processing record 232\n",
      "[1734946974.56] Processing record 233\n",
      "[1734946975.1] Processing record 234\n",
      "[1734946975.65] Processing record 235\n",
      "[1734946976.19] Processing record 236\n",
      "[1734946976.74] Processing record 237\n",
      "[1734946977.29] Processing record 238\n",
      "[1734946977.84] Processing record 239\n",
      "[1734946978.38] Processing record 240\n",
      "[1734946978.92] Processing record 241\n",
      "[1734946979.47] Processing record 242\n",
      "[1734946980.02] Processing record 243\n",
      "[1734946980.56] Processing record 244\n",
      "[1734946981.1] Processing record 245\n",
      "[1734946981.66] Processing record 246\n",
      "[1734946982.21] Processing record 247\n",
      "[1734946982.75] Processing record 248\n",
      "[1734946983.29] Processing record 249\n",
      "[1734946983.8] Peak memory usage: 804365 bytes\n",
      "[1734946983.8] --- 137.4867079257965 seconds ---\n",
      "[1734946983.8] EAGER LOADING (execute_query)\n",
      "[1734946983.8] Submit query\n",
      "[1734946996.74] Processing record 0\n",
      "[1734946997.25] Processing record 1\n",
      "[1734946997.75] Processing record 2\n",
      "[1734946998.26] Processing record 3\n",
      "[1734946998.76] Processing record 4\n",
      "[1734946999.27] Processing record 5\n",
      "[1734946999.77] Processing record 6\n",
      "[1734947000.28] Processing record 7\n",
      "[1734947000.78] Processing record 8\n",
      "[1734947001.29] Processing record 9\n",
      "[1734947001.79] Processing record 10\n",
      "[1734947002.3] Processing record 11\n",
      "[1734947002.8] Processing record 12\n",
      "[1734947003.31] Processing record 13\n",
      "[1734947003.81] Processing record 14\n",
      "[1734947004.32] Processing record 15\n",
      "[1734947004.82] Processing record 16\n",
      "[1734947005.33] Processing record 17\n",
      "[1734947005.83] Processing record 18\n",
      "[1734947006.34] Processing record 19\n",
      "[1734947006.84] Processing record 20\n",
      "[1734947007.35] Processing record 21\n",
      "[1734947007.85] Processing record 22\n",
      "[1734947008.36] Processing record 23\n",
      "[1734947008.86] Processing record 24\n",
      "[1734947009.37] Processing record 25\n",
      "[1734947009.88] Processing record 26\n",
      "[1734947010.38] Processing record 27\n",
      "[1734947010.89] Processing record 28\n",
      "[1734947011.39] Processing record 29\n",
      "[1734947011.89] Processing record 30\n",
      "[1734947012.4] Processing record 31\n",
      "[1734947012.9] Processing record 32\n",
      "[1734947013.41] Processing record 33\n",
      "[1734947013.91] Processing record 34\n",
      "[1734947014.42] Processing record 35\n",
      "[1734947014.92] Processing record 36\n",
      "[1734947015.42] Processing record 37\n",
      "[1734947015.93] Processing record 38\n",
      "[1734947016.43] Processing record 39\n",
      "[1734947016.94] Processing record 40\n",
      "[1734947017.44] Processing record 41\n",
      "[1734947017.95] Processing record 42\n",
      "[1734947018.46] Processing record 43\n",
      "[1734947018.96] Processing record 44\n",
      "[1734947019.46] Processing record 45\n",
      "[1734947019.97] Processing record 46\n",
      "[1734947020.47] Processing record 47\n",
      "[1734947020.98] Processing record 48\n",
      "[1734947021.48] Processing record 49\n",
      "[1734947021.99] Processing record 50\n",
      "[1734947022.49] Processing record 51\n",
      "[1734947023.0] Processing record 52\n",
      "[1734947023.5] Processing record 53\n",
      "[1734947024.01] Processing record 54\n",
      "[1734947024.51] Processing record 55\n",
      "[1734947025.01] Processing record 56\n",
      "[1734947025.52] Processing record 57\n",
      "[1734947026.02] Processing record 58\n",
      "[1734947026.52] Processing record 59\n",
      "[1734947027.03] Processing record 60\n",
      "[1734947027.54] Processing record 61\n",
      "[1734947028.04] Processing record 62\n",
      "[1734947028.55] Processing record 63\n",
      "[1734947029.05] Processing record 64\n",
      "[1734947029.56] Processing record 65\n",
      "[1734947030.06] Processing record 66\n",
      "[1734947030.57] Processing record 67\n",
      "[1734947031.07] Processing record 68\n",
      "[1734947031.58] Processing record 69\n",
      "[1734947032.08] Processing record 70\n",
      "[1734947032.59] Processing record 71\n",
      "[1734947033.09] Processing record 72\n",
      "[1734947033.6] Processing record 73\n",
      "[1734947034.1] Processing record 74\n",
      "[1734947034.61] Processing record 75\n",
      "[1734947035.11] Processing record 76\n",
      "[1734947035.62] Processing record 77\n",
      "[1734947036.12] Processing record 78\n",
      "[1734947036.63] Processing record 79\n",
      "[1734947037.13] Processing record 80\n",
      "[1734947037.64] Processing record 81\n",
      "[1734947038.15] Processing record 82\n",
      "[1734947038.65] Processing record 83\n",
      "[1734947039.16] Processing record 84\n",
      "[1734947039.66] Processing record 85\n",
      "[1734947040.17] Processing record 86\n",
      "[1734947040.67] Processing record 87\n",
      "[1734947041.18] Processing record 88\n",
      "[1734947041.68] Processing record 89\n",
      "[1734947042.19] Processing record 90\n",
      "[1734947042.69] Processing record 91\n",
      "[1734947043.2] Processing record 92\n",
      "[1734947043.7] Processing record 93\n",
      "[1734947044.21] Processing record 94\n",
      "[1734947044.71] Processing record 95\n",
      "[1734947045.22] Processing record 96\n",
      "[1734947045.72] Processing record 97\n",
      "[1734947046.23] Processing record 98\n",
      "[1734947046.73] Processing record 99\n",
      "[1734947047.24] Processing record 100\n",
      "[1734947047.74] Processing record 101\n",
      "[1734947048.25] Processing record 102\n",
      "[1734947048.76] Processing record 103\n",
      "[1734947049.26] Processing record 104\n",
      "[1734947049.77] Processing record 105\n",
      "[1734947050.27] Processing record 106\n",
      "[1734947050.78] Processing record 107\n",
      "[1734947051.28] Processing record 108\n",
      "[1734947051.79] Processing record 109\n",
      "[1734947052.29] Processing record 110\n",
      "[1734947052.8] Processing record 111\n",
      "[1734947053.3] Processing record 112\n",
      "[1734947053.81] Processing record 113\n",
      "[1734947054.31] Processing record 114\n",
      "[1734947054.82] Processing record 115\n",
      "[1734947055.32] Processing record 116\n",
      "[1734947055.83] Processing record 117\n",
      "[1734947056.33] Processing record 118\n",
      "[1734947056.84] Processing record 119\n",
      "[1734947057.34] Processing record 120\n",
      "[1734947057.85] Processing record 121\n",
      "[1734947058.35] Processing record 122\n",
      "[1734947058.86] Processing record 123\n",
      "[1734947059.36] Processing record 124\n",
      "[1734947059.87] Processing record 125\n",
      "[1734947060.37] Processing record 126\n",
      "[1734947060.88] Processing record 127\n",
      "[1734947061.38] Processing record 128\n",
      "[1734947061.89] Processing record 129\n",
      "[1734947062.39] Processing record 130\n",
      "[1734947062.9] Processing record 131\n",
      "[1734947063.4] Processing record 132\n",
      "[1734947063.91] Processing record 133\n",
      "[1734947064.41] Processing record 134\n",
      "[1734947064.92] Processing record 135\n",
      "[1734947065.42] Processing record 136\n",
      "[1734947065.93] Processing record 137\n",
      "[1734947066.43] Processing record 138\n",
      "[1734947066.94] Processing record 139\n",
      "[1734947067.44] Processing record 140\n",
      "[1734947067.95] Processing record 141\n",
      "[1734947068.46] Processing record 142\n",
      "[1734947068.96] Processing record 143\n",
      "[1734947069.47] Processing record 144\n",
      "[1734947069.97] Processing record 145\n",
      "[1734947070.48] Processing record 146\n",
      "[1734947070.98] Processing record 147\n",
      "[1734947071.49] Processing record 148\n",
      "[1734947071.99] Processing record 149\n",
      "[1734947072.49] Processing record 150\n",
      "[1734947073.0] Processing record 151\n",
      "[1734947073.51] Processing record 152\n",
      "[1734947074.01] Processing record 153\n",
      "[1734947074.52] Processing record 154\n",
      "[1734947075.02] Processing record 155\n",
      "[1734947075.53] Processing record 156\n",
      "[1734947076.03] Processing record 157\n",
      "[1734947076.54] Processing record 158\n",
      "[1734947077.04] Processing record 159\n",
      "[1734947077.55] Processing record 160\n",
      "[1734947078.05] Processing record 161\n",
      "[1734947078.56] Processing record 162\n",
      "[1734947079.06] Processing record 163\n",
      "[1734947079.57] Processing record 164\n",
      "[1734947080.07] Processing record 165\n",
      "[1734947080.58] Processing record 166\n",
      "[1734947081.08] Processing record 167\n",
      "[1734947081.59] Processing record 168\n",
      "[1734947082.09] Processing record 169\n",
      "[1734947082.6] Processing record 170\n",
      "[1734947083.1] Processing record 171\n",
      "[1734947083.61] Processing record 172\n",
      "[1734947084.11] Processing record 173\n",
      "[1734947084.62] Processing record 174\n",
      "[1734947085.12] Processing record 175\n",
      "[1734947085.63] Processing record 176\n",
      "[1734947086.13] Processing record 177\n",
      "[1734947086.64] Processing record 178\n",
      "[1734947087.14] Processing record 179\n",
      "[1734947087.64] Processing record 180\n",
      "[1734947088.15] Processing record 181\n",
      "[1734947088.65] Processing record 182\n",
      "[1734947089.16] Processing record 183\n",
      "[1734947089.66] Processing record 184\n",
      "[1734947090.17] Processing record 185\n",
      "[1734947090.67] Processing record 186\n",
      "[1734947091.18] Processing record 187\n",
      "[1734947091.68] Processing record 188\n",
      "[1734947092.19] Processing record 189\n",
      "[1734947092.69] Processing record 190\n",
      "[1734947093.19] Processing record 191\n",
      "[1734947093.7] Processing record 192\n",
      "[1734947094.2] Processing record 193\n",
      "[1734947094.7] Processing record 194\n",
      "[1734947095.21] Processing record 195\n",
      "[1734947095.71] Processing record 196\n",
      "[1734947096.22] Processing record 197\n",
      "[1734947096.72] Processing record 198\n",
      "[1734947097.23] Processing record 199\n",
      "[1734947097.73] Processing record 200\n",
      "[1734947098.24] Processing record 201\n",
      "[1734947098.74] Processing record 202\n",
      "[1734947099.25] Processing record 203\n",
      "[1734947099.75] Processing record 204\n",
      "[1734947100.26] Processing record 205\n",
      "[1734947100.77] Processing record 206\n",
      "[1734947101.27] Processing record 207\n",
      "[1734947101.78] Processing record 208\n",
      "[1734947102.28] Processing record 209\n",
      "[1734947102.78] Processing record 210\n",
      "[1734947103.29] Processing record 211\n",
      "[1734947103.79] Processing record 212\n",
      "[1734947104.3] Processing record 213\n",
      "[1734947104.8] Processing record 214\n",
      "[1734947105.31] Processing record 215\n",
      "[1734947105.82] Processing record 216\n",
      "[1734947106.32] Processing record 217\n",
      "[1734947106.83] Processing record 218\n",
      "[1734947107.33] Processing record 219\n",
      "[1734947107.84] Processing record 220\n",
      "[1734947108.34] Processing record 221\n",
      "[1734947108.84] Processing record 222\n",
      "[1734947109.35] Processing record 223\n",
      "[1734947109.86] Processing record 224\n",
      "[1734947110.36] Processing record 225\n",
      "[1734947110.87] Processing record 226\n",
      "[1734947111.37] Processing record 227\n",
      "[1734947111.88] Processing record 228\n",
      "[1734947112.38] Processing record 229\n",
      "[1734947112.89] Processing record 230\n",
      "[1734947113.39] Processing record 231\n",
      "[1734947113.9] Processing record 232\n",
      "[1734947114.4] Processing record 233\n",
      "[1734947114.91] Processing record 234\n",
      "[1734947115.41] Processing record 235\n",
      "[1734947115.92] Processing record 236\n",
      "[1734947116.42] Processing record 237\n",
      "[1734947116.93] Processing record 238\n",
      "[1734947117.43] Processing record 239\n",
      "[1734947117.94] Processing record 240\n",
      "[1734947118.44] Processing record 241\n",
      "[1734947118.95] Processing record 242\n",
      "[1734947119.45] Processing record 243\n",
      "[1734947119.96] Processing record 244\n",
      "[1734947120.46] Processing record 245\n",
      "[1734947120.97] Processing record 246\n",
      "[1734947121.47] Processing record 247\n",
      "[1734947121.98] Processing record 248\n",
      "[1734947122.49] Processing record 249\n",
      "[1734947123.32] Peak memory usage: 89600875 bytes\n",
      "[1734947123.32] --- 139.51864576339722 seconds ---\n"
     ]
    }
   ],
   "source": [
    "import neo4j\n",
    "from time import sleep, time\n",
    "import tracemalloc\n",
    "\n",
    "\n",
    "\n",
    "URI = \"bolt://localhost:7687\"\n",
    "AUTH = (\"neo4j\", \"password\")\n",
    "\n",
    "# Returns 250 records, each with properties\n",
    "# - `output` (an expensive computation, to slow down retrieval)\n",
    "# - `dummyData` (a list of 10000 ints, about 8 KB).\n",
    "slow_query = '''\n",
    "UNWIND range(1, 250) AS s\n",
    "RETURN reduce(s=s, x in range(1,1000000) | s + sin(toFloat(x))+cos(toFloat(x))) AS output,\n",
    "       range(1, 10000) AS dummyData\n",
    "'''\n",
    "# Delay for each processed record\n",
    "sleep_time = 0.5\n",
    "\n",
    "\n",
    "def main():\n",
    "    with neo4j.GraphDatabase.driver(URI, auth=AUTH) as driver:\n",
    "        driver.verify_connectivity()\n",
    "\n",
    "        start_time = time()\n",
    "        log('LAZY LOADING (execute_read)')\n",
    "        tracemalloc.start()\n",
    "        lazy_loading(driver)\n",
    "        log(f'Peak memory usage: {tracemalloc.get_traced_memory()[1]} bytes')\n",
    "        tracemalloc.stop()\n",
    "        log('--- %s seconds ---' % (time() - start_time))\n",
    "\n",
    "        start_time = time()\n",
    "        log('EAGER LOADING (execute_query)')\n",
    "        tracemalloc.start()\n",
    "        eager_loading(driver)\n",
    "        log(f'Peak memory usage: {tracemalloc.get_traced_memory()[1]} bytes')\n",
    "        tracemalloc.stop()\n",
    "        log('--- %s seconds ---' % (time() - start_time))\n",
    "\n",
    "\n",
    "def lazy_loading(driver):\n",
    "\n",
    "    def process_records(tx):\n",
    "        log('Submit query')\n",
    "        result = tx.run(slow_query)\n",
    "\n",
    "        for record in result:\n",
    "            log(f'Processing record {int(record.get(\"output\"))}')\n",
    "            sleep(sleep_time)  # proxy for some expensive operation\n",
    "\n",
    "    with driver.session(database='neo4j') as session:\n",
    "        processed_result = session.execute_read(process_records)\n",
    "\n",
    "\n",
    "def eager_loading(driver):\n",
    "    log('Submit query')\n",
    "    records, _, _ = driver.execute_query(slow_query, database_='neo4j')\n",
    "\n",
    "    for record in records:\n",
    "        log(f'Processing record {int(record.get(\"output\"))}')\n",
    "        sleep(sleep_time)  # proxy for some expensive operation\n",
    "\n",
    "\n",
    "def log(msg):\n",
    "    print(f'[{round(time(), 2)}] {msg}')\n",
    "\n",
    "\n",
    "if __name__ == '__main__':\n",
    "    main()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# good practing routing to read node\n",
    "driver.execute_query(\"MATCH (p:Person) RETURN p\", routing_=\"r\")\n",
    "session.execute_read(lambda tx: tx.run(\"MATCH (p:Person) RETURN p\"))\n",
    "\n",
    "# bad practice \n",
    "driver.execute_query(\"MATCH (p:Person) RETURN p\")\n",
    "# defaults to routing = writers\n",
    "session.execute_write(lambda tx: tx.run(\"MATCH (p:Person) RETURN p\"))\n",
    "# don't ask to write on a read-only operation"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Create an index on Person.name\n",
    "driver.execute_query(\"CREATE INDEX person_name FOR (n:Person) ON (n.name)\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "profile queries to find areas to improve"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 218,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Cypher 5\n",
      "\n",
      "Planner COST\n",
      "\n",
      "Runtime PIPELINED\n",
      "\n",
      "Runtime version 5.24\n",
      "\n",
      "Batch size 128\n",
      "\n",
      "+------------------+----+----------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+\n",
      "| Operator         | Id | Details        | Estimated Rows | Rows | DB Hits | Memory (Bytes) | Page Cache Hits/Misses | Time (ms) | Pipeline            |\n",
      "+------------------+----+----------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+\n",
      "| +ProduceResults  |  0 | p              |              1 |    2 |       6 |              0 |                        |           |                     |\n",
      "| |                +----+----------------+----------------+------+---------+----------------+                        |           |                     |\n",
      "| +Filter          |  1 | p.name = $name |              1 |    2 |       8 |                |                        |           |                     |\n",
      "| |                +----+----------------+----------------+------+---------+----------------+                        |           |                     |\n",
      "| +NodeByLabelScan |  2 | p:PLAYER       |             10 |    4 |       5 |            248 |                    2/0 |     3.363 | Fused in Pipeline 0 |\n",
      "+------------------+----+----------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+\n",
      "\n",
      "Total database accesses: 19, total allocated memory: 312\n",
      "\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/var/folders/pq/j682cyjd7cb0xq6g_rj_397w0000gn/T/ipykernel_29955/1745637161.py:1: DeprecationWarning: Using a driver after it has been closed is deprecated. Future versions of the driver will raise an error.\n",
      "  _, summary, _ = driver.execute_query(\"PROFILE MATCH (p:PLAYER {name: $name}) RETURN p\", name=\"Ezra\")\n"
     ]
    }
   ],
   "source": [
    "_, summary, _ = driver.execute_query(\"PROFILE MATCH (p:PLAYER {name: $name}) RETURN p\", name=\"Ezra\")\n",
    "print(summary.profile['args']['string-representation'])"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "BATCH DATA creatioong using WITH AND UNWIND clauses"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "numbers = [{\"value\": random()} for _ in range(10000)]\n",
    "driver.execute_query(\"\"\"\n",
    "    WITH $numbers AS batch\n",
    "    UNWIND batch AS node\n",
    "    MERGE (n:Number)\n",
    "    SET n.value = node.value\n",
    "    \"\"\", numbers=numbers,\n",
    ")\n",
    "\n",
    "# bad pracitice\n",
    "for _ in range(10000):\n",
    "    driver.execute_query(\"MERGE (:Number {value: $value})\", value=random())"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.16"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
